[
    {
        "qid": "WebQTrn-1487",
        "question": "where did the columbia river begin",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.01n86",
                    "class": "common.topic",
                    "friendly_name": "columbia river",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "geography.river.origin"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01n86)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01n86 ns:geography.river.origin ?x .\n}\n",
        "topic_entity": "m.01n86",
        "answer": [
            {
                "answer_argument": "m.02r8kvz",
                "answer_type": "Entity",
                "entity_name": "Columbia Lake"
            }
        ],
        "s_expression": "(JOIN (R geography.river.origin) m.01n86)",
        "s_expression_processed": "(JOIN (R geography.river.origin) m.01n86)"
    },
    {
        "qid": "WebQTrn-1672",
        "question": "what is the state symbols of colorado",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.01n4w",
                    "class": "common.topic",
                    "friendly_name": "colorado",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "government.governmental_jurisdiction.official_symbols"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.location_symbol_relationship.symbol"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01n4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01n4w ns:government.governmental_jurisdiction.official_symbols ?y .\n?y ns:location.location_symbol_relationship.symbol ?x .\n}\n",
        "topic_entity": "m.01n4w",
        "answer": [
            {
                "answer_argument": "m.01bcrt",
                "answer_type": "Entity",
                "entity_name": "Stegosaurus"
            },
            {
                "answer_argument": "m.02jkkg",
                "answer_type": "Entity",
                "entity_name": "Lark bunting"
            },
            {
                "answer_argument": "m.04gwdl",
                "answer_type": "Entity",
                "entity_name": "Painted turtle"
            },
            {
                "answer_argument": "m.0583c6",
                "answer_type": "Entity",
                "entity_name": "Blue spruce"
            },
            {
                "answer_argument": "m.067bnc",
                "answer_type": "Entity",
                "entity_name": "Yule Marble"
            },
            {
                "answer_argument": "m.069d4f",
                "answer_type": "Entity",
                "entity_name": "Aquilegia caerulea"
            },
            {
                "answer_argument": "m.07dzvh",
                "answer_type": "Entity",
                "entity_name": "Nil sine numine"
            },
            {
                "answer_argument": "m.0dvt08",
                "answer_type": "Entity",
                "entity_name": "Greenback cutthroat trout"
            }
        ],
        "s_expression": "(JOIN (R location.location_symbol_relationship.symbol) (JOIN (R government.governmental_jurisdiction.official_symbols) m.01n4w))",
        "s_expression_processed": "(JOIN (R location.location_symbol_relationship.symbol) (JOIN (R government.governmental_jurisdiction.official_symbols) m.01n4w))"
    },
    {
        "qid": "WebQTrn-2045",
        "question": "who won american idol 2006 season 5",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.09zcyj",
                    "class": "common.topic",
                    "friendly_name": "american idol 2006",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "award.competition.winner"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09zcyj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09zcyj ns:award.competition.winner ?x .\n}\n",
        "topic_entity": "m.09zcyj",
        "answer": [
            {
                "answer_argument": "m.0bhslx",
                "answer_type": "Entity",
                "entity_name": "Taylor Hicks"
            }
        ],
        "s_expression": "(JOIN (R award.competition.winner) m.09zcyj)",
        "s_expression_processed": "(JOIN (R award.competition.winner) m.09zcyj)"
    },
    {
        "qid": "WebQTrn-2457",
        "question": "where did henry hudson come from",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.0c065",
                    "class": "common.topic",
                    "friendly_name": "henry hudson",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.place_of_birth"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c065)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c065 ns:people.person.place_of_birth ?x .\n}\n",
        "topic_entity": "m.0c065",
        "answer": [
            {
                "answer_argument": "m.02jx1",
                "answer_type": "Entity",
                "entity_name": "England"
            }
        ],
        "s_expression": "(JOIN (R people.person.place_of_birth) m.0c065)",
        "s_expression_processed": "(JOIN (R people.person.place_of_birth) m.0c065)"
    },
    {
        "qid": "WebQTrn-2493",
        "question": "who was rosemary clooney married to",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.0h8hk",
                    "class": "common.topic",
                    "friendly_name": "rosemary clooney",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "entity",
                    "id": "m.04ztj",
                    "class": "common.topic",
                    "friendly_name": "Marriage",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 1
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "people.person.spouse_s"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.marriage.spouse"
                },
                {
                    "start": 1,
                    "end": 3,
                    "relation": "people.marriage.type_of_union"
                }
            ]
        },
        "function": "none",
        "num_node": 4,
        "num_edge": 3,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h8hk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h8hk ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\n}\n",
        "topic_entity": "m.0h8hk",
        "answer": [
            {
                "answer_argument": "m.0gdkdhv",
                "answer_type": "Entity",
                "entity_name": "Dante DiPaolo"
            },
            {
                "answer_argument": "m.0sxqg",
                "answer_type": "Entity",
                "entity_name": "José Ferrer"
            }
        ],
        "s_expression": "(JOIN (R people.marriage.spouse) (AND (JOIN (R people.person.spouse_s) m.0h8hk) (JOIN people.marriage.type_of_union m.04ztj)))",
        "s_expression_processed": "(JOIN (R people.marriage.spouse) (CONS (JOIN (R people.person.spouse_s) m.0h8hk) people.marriage.type_of_union m.04ztj))"
    },
    {
        "qid": "WebQTrn-2590",
        "question": "what instrument does ringo starr play",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.01vrnsk",
                    "class": "common.topic",
                    "friendly_name": "ringo starr",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "music.group_member.instruments_played"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vrnsk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vrnsk ns:music.group_member.instruments_played ?x .\n}\n",
        "topic_entity": "m.01vrnsk",
        "answer": [
            {
                "answer_argument": "m.013y1f",
                "answer_type": "Entity",
                "entity_name": "Organ"
            },
            {
                "answer_argument": "m.01wy6",
                "answer_type": "Entity",
                "entity_name": "Clarinet"
            },
            {
                "answer_argument": "m.026t6",
                "answer_type": "Entity",
                "entity_name": "Drums"
            },
            {
                "answer_argument": "m.02fsn",
                "answer_type": "Entity",
                "entity_name": "Double bass"
            },
            {
                "answer_argument": "m.02hnl",
                "answer_type": "Entity",
                "entity_name": "Drums"
            },
            {
                "answer_argument": "m.0342h",
                "answer_type": "Entity",
                "entity_name": "Guitar"
            },
            {
                "answer_argument": "m.03qjg",
                "answer_type": "Entity",
                "entity_name": "Harmonica"
            },
            {
                "answer_argument": "m.04rzd",
                "answer_type": "Entity",
                "entity_name": "Mandolin"
            },
            {
                "answer_argument": "m.05148p4",
                "answer_type": "Entity",
                "entity_name": "Keyboard"
            },
            {
                "answer_argument": "m.05r5c",
                "answer_type": "Entity",
                "entity_name": "Piano"
            },
            {
                "answer_argument": "m.06ncr",
                "answer_type": "Entity",
                "entity_name": "Saxophone"
            },
            {
                "answer_argument": "m.07m2y",
                "answer_type": "Entity",
                "entity_name": "Tuba"
            },
            {
                "answer_argument": "m.0l14j_",
                "answer_type": "Entity",
                "entity_name": "Flute"
            },
            {
                "answer_argument": "m.0l14md",
                "answer_type": "Entity",
                "entity_name": "Percussion"
            }
        ],
        "s_expression": "(JOIN (R music.group_member.instruments_played) m.01vrnsk)",
        "s_expression_processed": "(JOIN (R music.group_member.instruments_played) m.01vrnsk)"
    },
    {
        "qid": "WebQTrn-2649",
        "question": "where is alex smith from",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.05dfhp",
                    "class": "common.topic",
                    "friendly_name": "alex smith",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.place_of_birth"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05dfhp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05dfhp ns:people.person.place_of_birth ?x .\n}\n",
        "topic_entity": "m.05dfhp",
        "answer": [
            {
                "answer_argument": "m.010rvx",
                "answer_type": "Entity",
                "entity_name": "Bremerton"
            }
        ],
        "s_expression": "(JOIN (R people.person.place_of_birth) m.05dfhp)",
        "s_expression_processed": "(JOIN (R people.person.place_of_birth) m.05dfhp)"
    },
    {
        "qid": "WebQTrn-2803",
        "question": "when was reagan inaugurated",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.06c0j",
                    "class": "common.topic",
                    "friendly_name": "reagan",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "base.inaugurations.inauguration_speaker.inauguration"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c0j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c0j ns:base.inaugurations.inauguration_speaker.inauguration ?x .\n}\n",
        "topic_entity": "m.06c0j",
        "answer": [
            {
                "answer_argument": "m.05bry73",
                "answer_type": "Entity",
                "entity_name": "Ronald Reagan 1981 presidential inauguration"
            },
            {
                "answer_argument": "m.05bryb8",
                "answer_type": "Entity",
                "entity_name": "Ronald Reagan 1985 presidential inauguration"
            }
        ],
        "s_expression": "(JOIN (R base.inaugurations.inauguration_speaker.inauguration) m.06c0j)",
        "s_expression_processed": "(JOIN (R base.inaugurations.inauguration_speaker.inauguration) m.06c0j)"
    },
    {
        "qid": "WebQTrn-2948",
        "question": "who played princess leia in star wars movies",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.0ddqw",
                    "class": "common.topic",
                    "friendly_name": "princess leia",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "film.film_character.portrayed_in_films"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "film.performance.actor"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ddqw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ddqw ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "topic_entity": "m.0ddqw",
        "answer": [
            {
                "answer_argument": "m.01tnbn",
                "answer_type": "Entity",
                "entity_name": "Carrie Fisher"
            },
            {
                "answer_argument": "m.01wm357",
                "answer_type": "Entity",
                "entity_name": "Eden Espinosa"
            }
        ],
        "s_expression": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0ddqw))",
        "s_expression_processed": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0ddqw))"
    },
    {
        "qid": "WebQTrn-3158",
        "question": "what boudicca do",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.01fz6",
                    "class": "common.topic",
                    "friendly_name": "boudicca",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "common.topic.notable_types"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fz6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fz6 ns:common.topic.notable_types ?x .\n}\n",
        "topic_entity": "m.01fz6",
        "answer": [
            {
                "answer_argument": "m.02h77nv",
                "answer_type": "Entity",
                "entity_name": "Military Commander"
            }
        ],
        "s_expression": "(JOIN (R common.topic.notable_types) m.01fz6)",
        "s_expression_processed": "(JOIN (R common.topic.notable_types) m.01fz6)"
    },
    {
        "qid": "WebQTrn-3255",
        "question": "where is pyramids located in egypt",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.03jmj1",
                    "class": "common.topic",
                    "friendly_name": "pyramids",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.location.containedby"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jmj1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jmj1 ns:location.location.containedby ?x .\n}\n",
        "topic_entity": "m.03jmj1",
        "answer": [
            {
                "answer_argument": "m.02k54",
                "answer_type": "Entity",
                "entity_name": "Egypt"
            }
        ],
        "s_expression": "(JOIN (R location.location.containedby) m.03jmj1)",
        "s_expression_processed": "(JOIN (R location.location.containedby) m.03jmj1)"
    },
    {
        "qid": "WebQTrn-3339",
        "question": "who plays lola bunny on the looney tunes show",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.0534r8",
                    "class": "common.topic",
                    "friendly_name": "lola bunny",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "entity",
                    "id": "m.04j2p8f",
                    "class": "common.topic",
                    "friendly_name": "looney tunes show",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "film.film_character.portrayed_in_films"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "film.performance.actor"
                },
                {
                    "start": 1,
                    "end": 3,
                    "relation": "film.performance.film"
                }
            ]
        },
        "function": "none",
        "num_node": 4,
        "num_edge": 3,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0534r8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0534r8 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.film ns:m.04j2p8f .\n}\n",
        "topic_entity": "m.0534r8",
        "answer": [
            {
                "answer_argument": "m.0fm5ld",
                "answer_type": "Entity",
                "entity_name": "Britt McKillip"
            }
        ],
        "s_expression": "(JOIN (R film.performance.actor) (AND (JOIN (R film.film_character.portrayed_in_films) m.0534r8) (JOIN film.performance.film m.04j2p8f)))",
        "s_expression_processed": "(JOIN (R film.performance.actor) (AND (JOIN (R film.film_character.portrayed_in_films) m.0534r8) (JOIN film.performance.film m.04j2p8f)))"
    }
]