[
    {
        "qid": "WebQTrn-3502",
        "question": "what is the capital of oregon",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.05kj_",
                    "class": "common.topic",
                    "friendly_name": "oregon",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "base.aareas.schema.administrative_area.capital"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05kj_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05kj_ ns:base.aareas.schema.administrative_area.capital ?x .\n}\n",
        "topic_entity": "m.05kj_",
        "answer": [
            {
                "answer_argument": "m.0d23k",
                "answer_type": "Entity",
                "entity_name": "Salem"
            }
        ],
        "s_expression": "(JOIN (R base.aareas.schema.administrative_area.capital) m.05kj_)",
        "s_expression_processed": "(JOIN (R base.aareas.schema.administrative_area.capital) m.05kj_)"
    },
    {
        "qid": "WebQTrn-3510",
        "question": "what teams did shaq play 4",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.012xdf",
                    "class": "common.topic",
                    "friendly_name": "shaq",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "sports.pro_athlete.teams"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "sports.sports_team_roster.team"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012xdf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012xdf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "topic_entity": "m.012xdf",
        "answer": [
            {
                "answer_argument": "m.026dqjm",
                "answer_type": "Entity",
                "entity_name": "LSU Tigers men's basketball"
            },
            {
                "answer_argument": "m.0bwjj",
                "answer_type": "Entity",
                "entity_name": "Boston Celtics"
            },
            {
                "answer_argument": "m.0jm2v",
                "answer_type": "Entity",
                "entity_name": "Miami Heat"
            },
            {
                "answer_argument": "m.0jm4b",
                "answer_type": "Entity",
                "entity_name": "Orlando Magic"
            },
            {
                "answer_argument": "m.0jm7n",
                "answer_type": "Entity",
                "entity_name": "Cleveland Cavaliers"
            },
            {
                "answer_argument": "m.0jmk7",
                "answer_type": "Entity",
                "entity_name": "Los Angeles Lakers"
            },
            {
                "answer_argument": "m.0jml5",
                "answer_type": "Entity",
                "entity_name": "Phoenix Suns"
            }
        ],
        "s_expression": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.012xdf))",
        "s_expression_processed": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.012xdf))"
    },
    {
        "qid": "WebQTrn-3750",
        "question": "what team rasheed wallace",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.02hdjz",
                    "class": "common.topic",
                    "friendly_name": "rasheed wallace",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "sports.pro_athlete.teams"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "sports.sports_team_roster.team"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02hdjz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02hdjz ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "topic_entity": "m.02hdjz",
        "answer": [
            {
                "answer_argument": "m.0bwjj",
                "answer_type": "Entity",
                "entity_name": "Boston Celtics"
            },
            {
                "answer_argument": "m.0jm3v",
                "answer_type": "Entity",
                "entity_name": "New York Knicks"
            },
            {
                "answer_argument": "m.0jm5b",
                "answer_type": "Entity",
                "entity_name": "Washington Wizards"
            },
            {
                "answer_argument": "m.0jm64",
                "answer_type": "Entity",
                "entity_name": "Atlanta Hawks"
            },
            {
                "answer_argument": "m.0jm8l",
                "answer_type": "Entity",
                "entity_name": "Detroit Pistons"
            },
            {
                "answer_argument": "m.0jmm4",
                "answer_type": "Entity",
                "entity_name": "Portland Trail Blazers"
            }
        ],
        "s_expression": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.02hdjz))",
        "s_expression_processed": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.02hdjz))"
    }
]