[
    {
        "qid": "WebQTrn-230",
        "question": "who is the new senator of montana",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.050l8",
                    "class": "common.topic",
                    "friendly_name": "montana",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "entity",
                    "id": "m.02_7l8y",
                    "class": "common.topic",
                    "friendly_name": "United States Senator",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 1
                },
                {
                    "nid": 4,
                    "node_type": "literal",
                    "id": "0^^http://www.w3.org/2001/XMLSchema#int",
                    "class": "common.topic",
                    "friendly_name": "0",
                    "question_node": 0,
                    "function": "argmax",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "government.political_district.representatives"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "government.government_position_held.office_holder"
                },
                {
                    "start": 1,
                    "end": 3,
                    "relation": "government.government_position_held.office_position_or_title"
                },
                {
                    "start": 1,
                    "end": 4,
                    "relation": "government.government_position_held.from"
                }
            ]
        },
        "function": "argmax",
        "num_node": 5,
        "num_edge": 4,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.050l8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.050l8 ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.office_position_or_title ns:m.02_7l8y .\n?y ns:government.government_position_held.from ?sk0 .\n}\nORDER BY DESC(xsd:datetime(?sk0))\nLIMIT 1\n",
        "topic_entity": "m.050l8",
        "answer": [
            {
                "answer_argument": "m.0nbx8tv",
                "answer_type": "Entity",
                "entity_name": "John Walsh"
            }
        ],
        "s_expression": "(ARGMAX (JOIN (R government.government_position_held.office_holder) (AND (JOIN (R government.political_district.representatives) m.050l8) (JOIN government.government_position_held.office_position_or_title m.02_7l8y))) (JOIN (R government.government_position_held.office_holder) government.government_position_held.from))",
        "s_expression_processed": "(ARGMAX (JOIN (R government.government_position_held.office_holder) (CONS (JOIN (R government.political_district.representatives) m.050l8) government.government_position_held.office_position_or_title m.02_7l8y)) (JOIN (R government.government_position_held.office_holder) government.government_position_held.from))"
    },
    {
        "qid": "WebQTrn-246",
        "question": "what are the three major rivers in south america",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "geography.river",
                    "class": "geography.river",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.06n3y",
                    "class": "common.topic",
                    "friendly_name": "south america",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 2,
                    "node_type": "literal",
                    "id": "0^^http://www.w3.org/2001/XMLSchema#int",
                    "class": "common.topic",
                    "friendly_name": "0",
                    "question_node": 0,
                    "function": "argmax",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.location.contains"
                },
                {
                    "start": 0,
                    "end": 2,
                    "relation": "geography.river.discharge"
                }
            ]
        },
        "function": "argmax",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06n3y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06n3y ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01xs05k .\n?x ns:geography.river.discharge ?sk0 .\n}\nORDER BY DESC(xsd:float(?sk0))\nLIMIT 3\n",
        "topic_entity": "m.06n3y",
        "answer": [
            {
                "answer_argument": "m.01tl45",
                "answer_type": "Entity",
                "entity_name": "Rio Negro"
            },
            {
                "answer_argument": "m.0lzjs",
                "answer_type": "Entity",
                "entity_name": "Orinoco"
            },
            {
                "answer_argument": "m.0sd7",
                "answer_type": "Entity",
                "entity_name": "Amazon River"
            }
        ],
        "s_expression": "(ARGMAX (AND geography.river (JOIN (R location.location.contains) m.06n3y)) geography.river.discharge)",
        "s_expression_processed": "(ARGMAX (AND geography.river (JOIN (R location.location.contains) m.06n3y)) geography.river.discharge)"
    },
    {
        "qid": "WebQTrn-249",
        "question": "who is tia and tamera mowry parents",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.054xvs",
                    "class": "common.topic",
                    "friendly_name": "tia",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.parents"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054xvs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054xvs ns:people.person.parents ?x .\n}\n",
        "topic_entity": "m.054xvs",
        "answer": [
            {
                "answer_argument": "m.0b_x1n8",
                "answer_type": "Entity",
                "entity_name": "Darlene Mowry"
            },
            {
                "answer_argument": "m.0gygc8m",
                "answer_type": "Entity",
                "entity_name": "Tim Mowry"
            }
        ],
        "s_expression": "(JOIN (R people.person.parents) m.054xvs)",
        "s_expression_processed": "(JOIN (R people.person.parents) m.054xvs)"
    },
    {
        "qid": "WebQTrn-437",
        "question": "where was greenpeace an international environmental organization founded",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.036qv",
                    "class": "common.topic",
                    "friendly_name": "greenpeace",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "organization.organization.place_founded"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036qv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036qv ns:organization.organization.place_founded ?x .\n}\n",
        "topic_entity": "m.036qv",
        "answer": [
            {
                "answer_argument": "m.080h2",
                "answer_type": "Entity",
                "entity_name": "Vancouver"
            }
        ],
        "s_expression": "(JOIN (R organization.organization.place_founded) m.036qv)",
        "s_expression_processed": "(JOIN (R organization.organization.place_founded) m.036qv)"
    },
    {
        "qid": "WebQTrn-483",
        "question": "what type of music did richard wagner play",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.06c44",
                    "class": "common.topic",
                    "friendly_name": "richard wagner",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "music.artist.genre"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c44)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c44 ns:music.artist.genre ?x .\n}\n",
        "topic_entity": "m.06c44",
        "answer": [
            {
                "answer_argument": "m.05lls",
                "answer_type": "Entity",
                "entity_name": "Opera"
            },
            {
                "answer_argument": "m.06gk7",
                "answer_type": "Entity",
                "entity_name": "Romantic music"
            },
            {
                "answer_argument": "m.0ggq0m",
                "answer_type": "Entity",
                "entity_name": "Classical music"
            }
        ],
        "s_expression": "(JOIN (R music.artist.genre) m.06c44)",
        "s_expression_processed": "(JOIN (R music.artist.genre) m.06c44)"
    },
    {
        "qid": "WebQTrn-563",
        "question": "what did lucille ball die of",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.04nw9",
                    "class": "common.topic",
                    "friendly_name": "lucille ball",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.deceased_person.cause_of_death"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04nw9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04nw9 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "topic_entity": "m.04nw9",
        "answer": [
            {
                "answer_argument": "m.01p3jd",
                "answer_type": "Entity",
                "entity_name": "Aortic dissection"
            }
        ],
        "s_expression": "(JOIN (R people.deceased_person.cause_of_death) m.04nw9)",
        "s_expression_processed": "(JOIN (R people.deceased_person.cause_of_death) m.04nw9)"
    },
    {
        "qid": "WebQTrn-564",
        "question": "what religion was john f kennedy",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.0d3k14",
                    "class": "common.topic",
                    "friendly_name": "john f kennedy",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "base.popstra.celebrity.religion"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "base.popstra.religion_choice.religion"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:base.popstra.celebrity.religion ?y .\n?y ns:base.popstra.religion_choice.religion ?x .\n}\n",
        "topic_entity": "m.0d3k14",
        "answer": [
            {
                "answer_argument": "m.0c8wxp",
                "answer_type": "Entity",
                "entity_name": "Catholicism"
            }
        ],
        "s_expression": "(JOIN (R base.popstra.religion_choice.religion) (JOIN (R base.popstra.celebrity.religion) m.0d3k14))",
        "s_expression_processed": "(JOIN (R base.popstra.religion_choice.religion) (JOIN (R base.popstra.celebrity.religion) m.0d3k14))"
    },
    {
        "qid": "WebQTrn-834",
        "question": "what office does hillary clinton hold",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.0d06m5",
                    "class": "common.topic",
                    "friendly_name": "hillary clinton",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "base.government2.appointed_official.appointments"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.appointment.appointed_role"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d06m5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d06m5 ns:base.government2.appointed_official.appointments ?y .\n?y ns:people.appointment.appointed_role ?x .\n}\n",
        "topic_entity": "m.0d06m5",
        "answer": [
            {
                "answer_argument": "m.07y07",
                "answer_type": "Entity",
                "entity_name": "United States Secretary of State"
            }
        ],
        "s_expression": "(JOIN (R people.appointment.appointed_role) (JOIN (R base.government2.appointed_official.appointments) m.0d06m5))",
        "s_expression_processed": "(JOIN (R people.appointment.appointed_role) (JOIN (R base.government2.appointed_official.appointments) m.0d06m5))"
    },
    {
        "qid": "WebQTrn-882",
        "question": "what language do u speak in egypt",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.02k54",
                    "class": "common.topic",
                    "friendly_name": "egypt",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.country.official_language"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02k54)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02k54 ns:location.country.official_language ?x .\n}\n",
        "topic_entity": "m.02k54",
        "answer": [
            {
                "answer_argument": "m.025rvv7",
                "answer_type": "Entity",
                "entity_name": "Modern Standard Arabic"
            }
        ],
        "s_expression": "(JOIN (R location.country.official_language) m.02k54)",
        "s_expression_processed": "(JOIN (R location.country.official_language) m.02k54)"
    },
    {
        "qid": "WebQTrn-889",
        "question": "who play luke skywalker",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.0f1bg",
                    "class": "common.topic",
                    "friendly_name": "luke skywalker",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "film.film_character.portrayed_in_films"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "film.performance.actor"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f1bg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f1bg ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "topic_entity": "m.0f1bg",
        "answer": [
            {
                "answer_argument": "m.0154d7",
                "answer_type": "Entity",
                "entity_name": "Mark Hamill"
            },
            {
                "answer_argument": "m.07l4yc",
                "answer_type": "Entity",
                "entity_name": "Bob Bergen"
            }
        ],
        "s_expression": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0f1bg))",
        "s_expression_processed": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0f1bg))"
    },
    {
        "qid": "WebQTrn-1117",
        "question": "where did sergio romo go to college",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "education.university",
                    "class": "education.university",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.04cyz8g",
                    "class": "common.topic",
                    "friendly_name": "sergio romo",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "people.person.education"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "education.education.institution"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04cyz8g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04cyz8g ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n}\n",
        "topic_entity": "m.04cyz8g",
        "answer": [
            {
                "answer_argument": "m.02hscq",
                "answer_type": "Entity",
                "entity_name": "University of North Alabama"
            }
        ],
        "s_expression": "(AND education.university (JOIN (R education.education.institution) (JOIN (R people.person.education) m.04cyz8g)))",
        "s_expression_processed": "(AND education.university (JOIN (R education.education.institution) (JOIN (R people.person.education) m.04cyz8g)))"
    },
    {
        "qid": "WebQTrn-1411",
        "question": "where did harry truman die",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.09bg4l",
                    "class": "common.topic",
                    "friendly_name": "harry truman",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.deceased_person.place_of_death"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09bg4l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09bg4l ns:people.deceased_person.place_of_death ?x .\n}\n",
        "topic_entity": "m.09bg4l",
        "answer": [
            {
                "answer_argument": "m.04f_d",
                "answer_type": "Entity",
                "entity_name": "Kansas City"
            }
        ],
        "s_expression": "(JOIN (R people.deceased_person.place_of_death) m.09bg4l)",
        "s_expression_processed": "(JOIN (R people.deceased_person.place_of_death) m.09bg4l)"
    },
    {
        "qid": "WebQTrn-1463",
        "question": "what currency do i need in egypt",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.02k54",
                    "class": "common.topic",
                    "friendly_name": "egypt",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.country.currency_used"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02k54)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02k54 ns:location.country.currency_used ?x .\n}\n",
        "topic_entity": "m.02k54",
        "answer": [
            {
                "answer_argument": "m.04phzg",
                "answer_type": "Entity",
                "entity_name": "Egyptian pound"
            }
        ],
        "s_expression": "(JOIN (R location.country.currency_used) m.02k54)",
        "s_expression_processed": "(JOIN (R location.country.currency_used) m.02k54)"
    }
]