[
    {
        "qid": "WebQTrn-20",
        "question": "where to fly into bali",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.01bkb",
                    "class": "common.topic",
                    "friendly_name": "bali",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "entity",
                    "id": "m.03qb78c",
                    "class": "common.topic",
                    "friendly_name": "Air Transportation",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 1
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "travel.travel_destination.how_to_get_here"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "travel.transportation.transport_terminus"
                },
                {
                    "start": 1,
                    "end": 3,
                    "relation": "travel.transportation.mode_of_transportation"
                }
            ]
        },
        "function": "none",
        "num_node": 4,
        "num_edge": 3,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bkb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bkb ns:travel.travel_destination.how_to_get_here ?y .\n?y ns:travel.transportation.transport_terminus ?x .\n?y ns:travel.transportation.mode_of_transportation ns:m.03qb78c .\n}\n",
        "topic_entity": "m.01bkb",
        "answer": [
            {
                "answer_argument": "m.069hj8",
                "answer_type": "Entity",
                "entity_name": "Ngurah Rai International Airport"
            }
        ],
        "s_expression": "(JOIN (R travel.transportation.transport_terminus) (AND (JOIN (R travel.travel_destination.how_to_get_here) m.01bkb) (JOIN travel.transportation.mode_of_transportation m.03qb78c)))",
        "s_expression_processed": "(JOIN (R travel.transportation.transport_terminus) (CONS (JOIN (R travel.travel_destination.how_to_get_here) m.01bkb) travel.transportation.mode_of_transportation m.03qb78c))"
    },
    {
        "qid": "WebQTrn-21",
        "question": "who is the prime minister of ethiopia",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.019pcs",
                    "class": "common.topic",
                    "friendly_name": "ethiopia",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": [
                        "NOW",
                        "government.government_position_held.from"
                    ]
                },
                {
                    "nid": 3,
                    "node_type": "entity",
                    "id": "m.060bp",
                    "class": "common.topic",
                    "friendly_name": "Prime minister",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 1
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "government.governmental_jurisdiction.governing_officials"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "government.government_position_held.office_holder"
                },
                {
                    "start": 1,
                    "end": 3,
                    "relation": "government.government_position_held.basic_title"
                }
            ]
        },
        "function": "none",
        "num_node": 4,
        "num_edge": 3,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019pcs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019pcs ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060bp .\nFILTER(NOT EXISTS {?y ns:government.government_position_held.from ?sk0} || \nEXISTS {?y ns:government.government_position_held.from ?sk1 . \nFILTER(xsd:datetime(?sk1) <= \"2015-08-10\"^^xsd:dateTime) })\nFILTER(NOT EXISTS {?y ns:government.government_position_held.to ?sk2} || \nEXISTS {?y ns:government.government_position_held.to ?sk3 . \nFILTER(xsd:datetime(?sk3) >= \"2015-08-10\"^^xsd:dateTime) })\n}\n",
        "topic_entity": "m.019pcs",
        "answer": [
            {
                "answer_argument": "m.0dl1t3",
                "answer_type": "Entity",
                "entity_name": "Hailemariam Desalegn"
            }
        ],
        "s_expression": "(JOIN (R government.government_position_held.office_holder) (TC (AND (JOIN (R government.governmental_jurisdiction.governing_officials) m.019pcs) (JOIN government.government_position_held.basic_title m.060bp)) government.government_position_held.from NOW))",
        "s_expression_processed": "(JOIN (R government.government_position_held.office_holder) (TC (CONS (JOIN (R government.governmental_jurisdiction.governing_officials) m.019pcs) government.government_position_held.basic_title m.060bp) government.government_position_held.from NOW))"
    },
    {
        "qid": "WebQTrn-22",
        "question": "what to see near sedona arizona",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.0ny57",
                    "class": "common.topic",
                    "friendly_name": "sedona arizona",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "travel.travel_destination.tourist_attractions"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ny57)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ny57 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "topic_entity": "m.0ny57",
        "answer": [
            {
                "answer_argument": "m.026h8t6",
                "answer_type": "Entity",
                "entity_name": "Sycamore Canyon"
            },
            {
                "answer_argument": "m.02qswpp",
                "answer_type": "Entity",
                "entity_name": "Sedona International Film Festival"
            },
            {
                "answer_argument": "m.02ty7n",
                "answer_type": "Entity",
                "entity_name": "Sedona Airport"
            },
            {
                "answer_argument": "m.04crz42",
                "answer_type": "Entity",
                "entity_name": "Bell Rock"
            },
            {
                "answer_argument": "m.04xgf_s",
                "answer_type": "Entity",
                "entity_name": "Seven Canyons"
            },
            {
                "answer_argument": "m.07k8z2",
                "answer_type": "Entity",
                "entity_name": "Chapel of the Holy Cross"
            },
            {
                "answer_argument": "m.0dlm2c7",
                "answer_type": "Entity",
                "entity_name": "Red Rock State Park"
            },
            {
                "answer_argument": "m.0dqzqc",
                "answer_type": "Entity",
                "entity_name": "Slide Rock State Park"
            },
            {
                "answer_argument": "m.0f44c_",
                "answer_type": "Entity",
                "entity_name": "Oak Creek Canyon"
            },
            {
                "answer_argument": "m.0g5qfch",
                "answer_type": "Entity",
                "entity_name": "Honanki"
            },
            {
                "answer_argument": "m.0gj9fwx",
                "answer_type": "Entity",
                "entity_name": "Cathedral Rock"
            }
        ],
        "s_expression": "(JOIN (R travel.travel_destination.tourist_attractions) m.0ny57)",
        "s_expression_processed": "(JOIN (R travel.travel_destination.tourist_attractions) m.0ny57)"
    },
    {
        "qid": "WebQTrn-24",
        "question": "what form of government does russia have today",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.06bnz",
                    "class": "common.topic",
                    "friendly_name": "russia",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.country.form_of_government"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bnz ns:location.country.form_of_government ?x .\n}\n",
        "topic_entity": "m.06bnz",
        "answer": [
            {
                "answer_argument": "m.01dw03",
                "answer_type": "Entity",
                "entity_name": "Semi-presidential system"
            },
            {
                "answer_argument": "m.0c9rw5",
                "answer_type": "Entity",
                "entity_name": "Constitutional republic"
            },
            {
                "answer_argument": "m.0j729",
                "answer_type": "Entity",
                "entity_name": "Federal republic"
            }
        ],
        "s_expression": "(JOIN (R location.country.form_of_government) m.06bnz)",
        "s_expression_processed": "(JOIN (R location.country.form_of_government) m.06bnz)"
    },
    {
        "qid": "WebQTrn-30",
        "question": "which wife did king henry behead",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.03p77",
                    "class": "common.topic",
                    "friendly_name": "king henry",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "entity",
                    "id": "m.0jb19",
                    "class": "common.topic",
                    "friendly_name": "Decapitation",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 1
                },
                {
                    "nid": 4,
                    "node_type": "entity",
                    "id": "m.04ztj",
                    "class": "common.topic",
                    "friendly_name": "Marriage",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 1
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "people.person.spouse_s"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.marriage.spouse"
                },
                {
                    "start": 0,
                    "end": 3,
                    "relation": "people.deceased_person.cause_of_death"
                },
                {
                    "start": 1,
                    "end": 4,
                    "relation": "people.marriage.type_of_union"
                }
            ]
        },
        "function": "none",
        "num_node": 5,
        "num_edge": 4,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03p77)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03p77 ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?x ns:people.deceased_person.cause_of_death ns:m.0jb19 .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\n}\n",
        "topic_entity": "m.03p77",
        "answer": [
            {
                "answer_argument": "m.09sxn",
                "answer_type": "Entity",
                "entity_name": "Anne Boleyn"
            },
            {
                "answer_argument": "m.0crdw",
                "answer_type": "Entity",
                "entity_name": "Catherine Howard"
            }
        ],
        "s_expression": "(AND (JOIN (R people.marriage.spouse) (AND (JOIN (R people.person.spouse_s) m.03p77) (JOIN people.marriage.type_of_union m.04ztj))) (JOIN people.deceased_person.cause_of_death m.0jb19))",
        "s_expression_processed": "(CONS (JOIN (R people.marriage.spouse) (CONS (JOIN (R people.person.spouse_s) m.03p77) people.marriage.type_of_union m.04ztj)) people.deceased_person.cause_of_death m.0jb19)"
    },
    {
        "qid": "WebQTrn-31",
        "question": "who was ishmael 's mom",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.01ghr4",
                    "class": "common.topic",
                    "friendly_name": "ishmael",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.02zsn",
                    "class": "common.topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 1,
                    "friendly_name": "female"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.parents"
                },
                {
                    "start": 0,
                    "end": 2,
                    "relation": "people.person.gender"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ghr4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ghr4 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
        "topic_entity": "m.01ghr4",
        "answer": [
            {
                "answer_argument": "m.01sq9c",
                "answer_type": "Entity",
                "entity_name": "Hagar"
            }
        ],
        "s_expression": "(AND (JOIN (R people.person.parents) m.01ghr4) (JOIN people.person.gender m.02zsn))",
        "s_expression_processed": "(CONS (JOIN (R people.person.parents) m.01ghr4) people.person.gender m.02zsn)"
    },
    {
        "qid": "WebQTrn-32",
        "question": "what was malcolm x trying to accomplish",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.03f2h01",
                    "class": "common.topic",
                    "friendly_name": "malcolm x",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "base.activism.activist.area_of_activism"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03f2h01)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03f2h01 ns:base.activism.activist.area_of_activism ?x .\n}\n",
        "topic_entity": "m.03f2h01",
        "answer": [
            {
                "answer_argument": "m.074v_1j",
                "answer_type": "Entity",
                "entity_name": "Black Liberation"
            },
            {
                "answer_argument": "m.0g4pf68",
                "answer_type": "Entity",
                "entity_name": "African Americans' rights"
            }
        ],
        "s_expression": "(JOIN (R base.activism.activist.area_of_activism) m.03f2h01)",
        "s_expression_processed": "(JOIN (R base.activism.activist.area_of_activism) m.03f2h01)"
    },
    {
        "qid": "WebQTrn-33",
        "question": "where are the netherlands on a world map",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.059j2",
                    "class": "common.topic",
                    "friendly_name": "netherlands",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.location.containedby"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059j2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059j2 ns:location.location.containedby ?x .\n}\n",
        "topic_entity": "m.059j2",
        "answer": [
            {
                "answer_argument": "m.049nq",
                "answer_type": "Entity",
                "entity_name": "Kingdom of the Netherlands"
            }
        ],
        "s_expression": "(JOIN (R location.location.containedby) m.059j2)",
        "s_expression_processed": "(JOIN (R location.location.containedby) m.059j2)"
    },
    {
        "qid": "WebQTrn-35",
        "question": "what are the major cities in france",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.0f8l9c",
                    "class": "common.topic",
                    "friendly_name": "france",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.country.capital"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:location.country.capital ?x .\n}\n",
        "topic_entity": "m.0f8l9c",
        "answer": [
            {
                "answer_argument": "m.05qtj",
                "answer_type": "Entity",
                "entity_name": "Paris"
            }
        ],
        "s_expression": "(JOIN (R location.country.capital) m.0f8l9c)",
        "s_expression_processed": "(JOIN (R location.country.capital) m.0f8l9c)"
    },
    {
        "qid": "WebQTrn-36",
        "question": "what city did esther live in",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.02pn7",
                    "class": "common.topic",
                    "friendly_name": "esther",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.place_of_birth"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pn7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pn7 ns:people.person.place_of_birth ?x .\n}\n",
        "topic_entity": "m.02pn7",
        "answer": [
            {
                "answer_argument": "m.0gf0n",
                "answer_type": "Entity",
                "entity_name": "Susa"
            }
        ],
        "s_expression": "(JOIN (R people.person.place_of_birth) m.02pn7)",
        "s_expression_processed": "(JOIN (R people.person.place_of_birth) m.02pn7)"
    },
    {
        "qid": "WebQTrn-37",
        "question": "what sport do the toronto maple leafs play",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.0j6tr",
                    "class": "common.topic",
                    "friendly_name": "toronto maple leafs",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "base.events.event_presenting_organisation.event_feed"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "base.events.event_feed.type_of_event"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j6tr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j6tr ns:base.events.event_presenting_organisation.event_feed ?y .\n?y ns:base.events.event_feed.type_of_event ?x .\n}\n",
        "topic_entity": "m.0j6tr",
        "answer": [
            {
                "answer_argument": "m.03tmr",
                "answer_type": "Entity",
                "entity_name": "Ice Hockey"
            }
        ],
        "s_expression": "(JOIN (R base.events.event_feed.type_of_event) (JOIN (R base.events.event_presenting_organisation.event_feed) m.0j6tr))",
        "s_expression_processed": "(JOIN (R base.events.event_feed.type_of_event) (JOIN (R base.events.event_presenting_organisation.event_feed) m.0j6tr))"
    }
]