[
    {
        "qid": "WebQTrn-63",
        "question": "who is in the band bush",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.01727v",
                    "class": "common.topic",
                    "friendly_name": "bush",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "music.musical_group.member"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "music.group_membership.member"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01727v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01727v ns:music.musical_group.member ?y .\n?y ns:music.group_membership.member ?x .\n}\n",
        "topic_entity": "m.01727v",
        "answer": [
            {
                "answer_argument": "m.014qv7",
                "answer_type": "Entity",
                "entity_name": "Gavin Rossdale"
            },
            {
                "answer_argument": "m.01vs4sv",
                "answer_type": "Entity",
                "entity_name": "Robin Goodridge"
            },
            {
                "answer_argument": "m.01vs4t_",
                "answer_type": "Entity",
                "entity_name": "Chris Traynor"
            },
            {
                "answer_argument": "m.01vs4vw",
                "answer_type": "Entity",
                "entity_name": "Nigel Pulsford"
            },
            {
                "answer_argument": "m.01wrrdk",
                "answer_type": "Entity",
                "entity_name": "Spencer Cobrin"
            },
            {
                "answer_argument": "m.03d_qbn",
                "answer_type": "Entity",
                "entity_name": "Dave Parsons"
            },
            {
                "answer_argument": "m.08f647",
                "answer_type": "Entity",
                "entity_name": "Sacha Gervasi"
            },
            {
                "answer_argument": "m.0h88bb2",
                "answer_type": "Entity",
                "entity_name": "Sacha Puttnam"
            },
            {
                "answer_argument": "m.0j1v9tm",
                "answer_type": "Entity",
                "entity_name": "Corey Britz"
            },
            {
                "answer_argument": "m.0zdb8q6",
                "answer_type": "Entity",
                "entity_name": "Amir"
            }
        ],
        "s_expression": "(JOIN (R music.group_membership.member) (JOIN (R music.musical_group.member) m.01727v))",
        "s_expression_processed": "(JOIN (R music.group_membership.member) (JOIN (R music.musical_group.member) m.01727v))"
    },
    {
        "qid": "WebQTrn-64",
        "question": "what was tupac name in juice",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.07pzc",
                    "class": "common.topic",
                    "friendly_name": "tupac",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "entity",
                    "id": "m.08w51z",
                    "class": "common.topic",
                    "friendly_name": "Juice",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "film.actor.film"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "film.performance.character"
                },
                {
                    "start": 1,
                    "end": 3,
                    "relation": "film.performance.film"
                }
            ]
        },
        "function": "none",
        "num_node": 4,
        "num_edge": 3,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pzc ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n?y ns:film.performance.film ns:m.08w51z .\n}\n",
        "topic_entity": "m.07pzc",
        "answer": [
            {
                "answer_argument": "m.0h5rvlw",
                "answer_type": "Entity",
                "entity_name": "Bishop"
            }
        ],
        "s_expression": "(JOIN (R film.performance.character) (AND (JOIN (R film.actor.film) m.07pzc) (JOIN film.performance.film m.08w51z)))",
        "s_expression_processed": "(JOIN (R film.performance.character) (AND (JOIN (R film.actor.film) m.07pzc) (JOIN film.performance.film m.08w51z)))"
    },
    {
        "qid": "WebQTrn-65",
        "question": "what timezone is australia gmt",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.0chghy",
                    "class": "common.topic",
                    "friendly_name": "australia",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.location.time_zones"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chghy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chghy ns:location.location.time_zones ?x .\n}\n",
        "topic_entity": "m.0chghy",
        "answer": [
            {
                "answer_argument": "m.0y497_m",
                "answer_type": "Entity",
                "entity_name": "Australian Eastern Time Zone"
            },
            {
                "answer_argument": "m.0y497zw",
                "answer_type": "Entity",
                "entity_name": "Australian Central Time Zone"
            },
            {
                "answer_argument": "m.0y4980d",
                "answer_type": "Entity",
                "entity_name": "Australian Western Time Zone"
            },
            {
                "answer_argument": "m.0y498qn",
                "answer_type": "Entity",
                "entity_name": "Casey Time Zone"
            },
            {
                "answer_argument": "m.0y498v7",
                "answer_type": "Entity",
                "entity_name": "Central Western Time Zone"
            },
            {
                "answer_argument": "m.0y49954",
                "answer_type": "Entity",
                "entity_name": "Christmas Island Time Zone"
            },
            {
                "answer_argument": "m.0y49994",
                "answer_type": "Entity",
                "entity_name": "Cocos Islands Time Zone"
            },
            {
                "answer_argument": "m.0y499p1",
                "answer_type": "Entity",
                "entity_name": "Davis Time Zone"
            },
            {
                "answer_argument": "m.0y49btq",
                "answer_type": "Entity",
                "entity_name": "Heard and McDonald Islands Time Zone"
            },
            {
                "answer_argument": "m.0y4dpjf",
                "answer_type": "Entity",
                "entity_name": "Lord Howe Time Zone"
            },
            {
                "answer_argument": "m.0y4dr4c",
                "answer_type": "Entity",
                "entity_name": "Mawson Station Time Zone"
            },
            {
                "answer_argument": "m.0y4drym",
                "answer_type": "Entity",
                "entity_name": "Norfolk Time Zone"
            }
        ],
        "s_expression": "(JOIN (R location.location.time_zones) m.0chghy)",
        "s_expression_processed": "(JOIN (R location.location.time_zones) m.0chghy)"
    },
    {
        "qid": "WebQTrn-66",
        "question": "who does maggie grace play in taken",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.03_wpf",
                    "class": "common.topic",
                    "friendly_name": "maggie grace",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "entity",
                    "id": "m.0hhggmy",
                    "class": "common.topic",
                    "friendly_name": "Taken",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "film.actor.film"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "film.performance.character"
                },
                {
                    "start": 1,
                    "end": 3,
                    "relation": "film.performance.film"
                }
            ]
        },
        "function": "none",
        "num_node": 4,
        "num_edge": 3,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_wpf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_wpf ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n?y ns:film.performance.film ns:m.0hhggmy .\n}\n",
        "topic_entity": "m.03_wpf",
        "answer": [
            {
                "answer_argument": "m.0g_kvk0",
                "answer_type": "Entity",
                "entity_name": "Kim"
            }
        ],
        "s_expression": "(JOIN (R film.performance.character) (AND (JOIN (R film.actor.film) m.03_wpf) (JOIN film.performance.film m.0hhggmy)))",
        "s_expression_processed": "(JOIN (R film.performance.character) (AND (JOIN (R film.actor.film) m.03_wpf) (JOIN film.performance.film m.0hhggmy)))"
    },
    {
        "qid": "WebQTrn-67",
        "question": "what style of music did louis armstrong play",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.04n32",
                    "class": "common.topic",
                    "friendly_name": "louis armstrong",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "music.artist.genre"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04n32)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04n32 ns:music.artist.genre ?x .\n}\n",
        "topic_entity": "m.04n32",
        "answer": [
            {
                "answer_argument": "m.015y_n",
                "answer_type": "Entity",
                "entity_name": "Swing music"
            },
            {
                "answer_argument": "m.03_d0",
                "answer_type": "Entity",
                "entity_name": "Jazz"
            },
            {
                "answer_argument": "m.09xw2",
                "answer_type": "Entity",
                "entity_name": "Dixieland"
            },
            {
                "answer_argument": "m.0dhb2",
                "answer_type": "Entity",
                "entity_name": "Scat singing"
            },
            {
                "answer_argument": "m.0m40d",
                "answer_type": "Entity",
                "entity_name": "Traditional pop music"
            }
        ],
        "s_expression": "(JOIN (R music.artist.genre) m.04n32)",
        "s_expression_processed": "(JOIN (R music.artist.genre) m.04n32)"
    },
    {
        "qid": "WebQTrn-69",
        "question": "what tv show did joey lawrence play on",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.01pr9kj",
                    "class": "common.topic",
                    "friendly_name": "joey lawrence",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "tv.tv_actor.starring_roles"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "tv.regular_tv_appearance.series"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pr9kj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pr9kj ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n",
        "topic_entity": "m.01pr9kj",
        "answer": [
            {
                "answer_argument": "m.026_g9w",
                "answer_type": "Entity",
                "entity_name": "Run of the House"
            },
            {
                "answer_argument": "m.02xwgb",
                "answer_type": "Entity",
                "entity_name": "Blossom"
            },
            {
                "answer_argument": "m.036y7h",
                "answer_type": "Entity",
                "entity_name": "Gimme a Break!"
            },
            {
                "answer_argument": "m.0b6kw6d",
                "answer_type": "Entity",
                "entity_name": "Melissa & Joey"
            },
            {
                "answer_argument": "m.0g0tw9",
                "answer_type": "Entity",
                "entity_name": "Brotherly Love"
            },
            {
                "answer_argument": "m.0lc1qx5",
                "answer_type": "Entity",
                "entity_name": "Bow"
            }
        ],
        "s_expression": "(JOIN (R tv.regular_tv_appearance.series) (JOIN (R tv.tv_actor.starring_roles) m.01pr9kj))",
        "s_expression_processed": "(JOIN (R tv.regular_tv_appearance.series) (JOIN (R tv.tv_actor.starring_roles) m.01pr9kj))"
    },
    {
        "qid": "WebQTrn-87",
        "question": "what language do the speak in pakistan",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.05sb1",
                    "class": "common.topic",
                    "friendly_name": "pakistan",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.country.official_language"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05sb1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05sb1 ns:location.country.official_language ?x .\n}\n",
        "topic_entity": "m.05sb1",
        "answer": [
            {
                "answer_argument": "m.02h40lc",
                "answer_type": "Entity",
                "entity_name": "English Language"
            },
            {
                "answer_argument": "m.02hxcvy",
                "answer_type": "Entity",
                "entity_name": "Urdu Language"
            }
        ],
        "s_expression": "(JOIN (R location.country.official_language) m.05sb1)",
        "s_expression_processed": "(JOIN (R location.country.official_language) m.05sb1)"
    },
    {
        "qid": "WebQTrn-128",
        "question": "what year did tut became king",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.07hcc",
                    "class": "common.topic",
                    "friendly_name": "tut",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "base.ancientegypt.pharaoh.reign"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "measurement_unit.time_interval.start"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hcc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hcc ns:base.ancientegypt.pharaoh.reign ?y .\n?y ns:measurement_unit.time_interval.start ?x .\n}\n",
        "topic_entity": "m.07hcc",
        "answer": [
            {
                "answer_argument": "-1332",
                "answer_type": "Value",
                "entity_name": null
            }
        ],
        "s_expression": "(JOIN (R measurement_unit.time_interval.start) (JOIN (R base.ancientegypt.pharaoh.reign) m.07hcc))",
        "s_expression_processed": "(JOIN (R measurement_unit.time_interval.start) (JOIN (R base.ancientegypt.pharaoh.reign) m.07hcc))"
    },
    {
        "qid": "WebQTrn-163",
        "question": "what team did shaq play for first",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.012xdf",
                    "class": "common.topic",
                    "friendly_name": "shaq",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "literal",
                    "id": "0^^http://www.w3.org/2001/XMLSchema#int",
                    "class": "common.topic",
                    "friendly_name": "0",
                    "question_node": 0,
                    "function": "argmin",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "sports.pro_athlete.teams"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "sports.sports_team_roster.team"
                },
                {
                    "start": 1,
                    "end": 3,
                    "relation": "sports.sports_team_roster.from"
                }
            ]
        },
        "function": "argmin",
        "num_node": 4,
        "num_edge": 3,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012xdf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012xdf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?y ns:sports.sports_team_roster.from ?sk0 .\n}\nORDER BY xsd:datetime(?sk0)\nLIMIT 1\n",
        "topic_entity": "m.012xdf",
        "answer": [
            {
                "answer_argument": "m.026dqjm",
                "answer_type": "Entity",
                "entity_name": "LSU Tigers men's basketball"
            }
        ],
        "s_expression": "(ARGMIN (JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.012xdf)) (JOIN (R sports.sports_team_roster.team) sports.sports_team_roster.from))",
        "s_expression_processed": "(ARGMIN (JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.012xdf)) (JOIN (R sports.sports_team_roster.team) sports.sports_team_roster.from))"
    },
    {
        "qid": "WebQTrn-219",
        "question": "what does nick cannon play in",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.01d1st",
                    "class": "common.topic",
                    "friendly_name": "nick cannon",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "tv.tv_actor.starring_roles"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "tv.regular_tv_appearance.series"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01d1st)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01d1st ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n",
        "topic_entity": "m.01d1st",
        "answer": [
            {
                "answer_argument": "m.0125f1",
                "answer_type": "Entity",
                "entity_name": "All That"
            },
            {
                "answer_argument": "m.02pzsft",
                "answer_type": "Entity",
                "entity_name": "Nick Cannon Presents: Short Circuitz"
            },
            {
                "answer_argument": "m.02vrvv",
                "answer_type": "Entity",
                "entity_name": "Soul Train"
            },
            {
                "answer_argument": "m.0cnyxtv",
                "answer_type": "Entity",
                "entity_name": "The Nightlife"
            },
            {
                "answer_argument": "m.0d4x_3",
                "answer_type": "Entity",
                "entity_name": "The Nick Cannon Show"
            },
            {
                "answer_argument": "m.0m_921m",
                "answer_type": "Entity",
                "entity_name": "Mash Up"
            }
        ],
        "s_expression": "(JOIN (R tv.regular_tv_appearance.series) (JOIN (R tv.tv_actor.starring_roles) m.01d1st))",
        "s_expression_processed": "(JOIN (R tv.regular_tv_appearance.series) (JOIN (R tv.tv_actor.starring_roles) m.01d1st))"
    }
]