[
    {
        "qid": "WebQTrn-40",
        "question": "what is cher 's son 's name",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.01vtj38",
                    "class": "common.topic",
                    "friendly_name": "cher",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.05zppz",
                    "class": "common.topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 1,
                    "friendly_name": "male"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.children"
                },
                {
                    "start": 0,
                    "end": 2,
                    "relation": "people.person.gender"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vtj38)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vtj38 ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "topic_entity": "m.01vtj38",
        "answer": [
            {
                "answer_argument": "m.01w4bt1",
                "answer_type": "Entity",
                "entity_name": "Elijah Blue Allman"
            },
            {
                "answer_argument": "m.0br66",
                "answer_type": "Entity",
                "entity_name": "Chaz Bono"
            }
        ],
        "s_expression": "(AND (JOIN (R people.person.children) m.01vtj38) (JOIN people.person.gender m.05zppz))",
        "s_expression_processed": "(CONS (JOIN (R people.person.children) m.01vtj38) people.person.gender m.05zppz)"
    },
    {
        "qid": "WebQTrn-42",
        "question": "what party was andrew jackson",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.0rlz",
                    "class": "common.topic",
                    "friendly_name": "andrew jackson",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "government.politician.party"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "government.political_party_tenure.party"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rlz ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "topic_entity": "m.0rlz",
        "answer": [
            {
                "answer_argument": "m.020lwv",
                "answer_type": "Entity",
                "entity_name": "Jacksonian Democratic Party"
            },
            {
                "answer_argument": "m.07wf9",
                "answer_type": "Entity",
                "entity_name": "Democratic-Republican Party"
            },
            {
                "answer_argument": "m.0d075m",
                "answer_type": "Entity",
                "entity_name": "Democratic Party"
            }
        ],
        "s_expression": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.0rlz))",
        "s_expression_processed": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.0rlz))"
    },
    {
        "qid": "WebQTrn-45",
        "question": "what is the name of the first harry potter novel",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.078ffw",
                    "class": "common.topic",
                    "friendly_name": "harry potter",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 2,
                    "node_type": "literal",
                    "id": "0^^http://www.w3.org/2001/XMLSchema#int",
                    "class": "common.topic",
                    "friendly_name": "0",
                    "question_node": 0,
                    "function": "argmin",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "book.literary_series.works_in_this_series"
                },
                {
                    "start": 0,
                    "end": 2,
                    "relation": "book.written_work.date_of_first_publication"
                }
            ]
        },
        "function": "argmin",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.078ffw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.078ffw ns:book.literary_series.works_in_this_series ?x .\n?x ns:book.written_work.date_of_first_publication ?sk0 .\n}\nORDER BY xsd:datetime(?sk0)\nLIMIT 1\n",
        "topic_entity": "m.078ffw",
        "answer": [
            {
                "answer_argument": "m.0c_vk",
                "answer_type": "Entity",
                "entity_name": "Harry Potter and the Philosopher's Stone"
            }
        ],
        "s_expression": "(ARGMIN (JOIN (R book.literary_series.works_in_this_series) m.078ffw) book.written_work.date_of_first_publication)",
        "s_expression_processed": "(ARGMIN (JOIN (R book.literary_series.works_in_this_series) m.078ffw) book.written_work.date_of_first_publication)"
    },
    {
        "qid": "WebQTrn-46",
        "question": "what did william shakespeare do for a living",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.081k8",
                    "class": "common.topic",
                    "friendly_name": "william shakespeare",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.profession"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.profession ?x .\n}\n",
        "topic_entity": "m.081k8",
        "answer": [
            {
                "answer_argument": "m.025352",
                "answer_type": "Entity",
                "entity_name": "Lyricist"
            },
            {
                "answer_argument": "m.02hrh1q",
                "answer_type": "Entity",
                "entity_name": "Actor"
            },
            {
                "answer_argument": "m.02hv44_",
                "answer_type": "Entity",
                "entity_name": "Playwright"
            },
            {
                "answer_argument": "m.05z96",
                "answer_type": "Entity",
                "entity_name": "Poet"
            },
            {
                "answer_argument": "m.0kyk",
                "answer_type": "Entity",
                "entity_name": "Author"
            }
        ],
        "s_expression": "(JOIN (R people.person.profession) m.081k8)",
        "s_expression_processed": "(JOIN (R people.person.profession) m.081k8)"
    },
    {
        "qid": "WebQTrn-47",
        "question": "what county is heathrow airport in",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "location.location",
                    "class": "location.location",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.03jn4",
                    "class": "common.topic",
                    "friendly_name": "heathrow airport",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.location.containedby"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jn4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jn4 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01n7 .\n}\n",
        "topic_entity": "m.03jn4",
        "answer": [
            {
                "answer_argument": "m.04pxy3",
                "answer_type": "Entity",
                "entity_name": "Hillingdon"
            }
        ],
        "s_expression": "(AND location.location (JOIN (R location.location.containedby) m.03jn4))",
        "s_expression_processed": "(AND location.location (JOIN (R location.location.containedby) m.03jn4))"
    },
    {
        "qid": "WebQTrn-53",
        "question": "what year did william jennings bryan run for president",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.0b3tf",
                    "class": "common.topic",
                    "friendly_name": "william jennings bryan",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "base.politicalconventions.presidential_nominee.nominated_at"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b3tf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b3tf ns:base.politicalconventions.presidential_nominee.nominated_at ?x .\n}\n",
        "topic_entity": "m.0b3tf",
        "answer": [
            {
                "answer_argument": "m.0b4pfj",
                "answer_type": "Entity",
                "entity_name": "1896 Democratic National Convention"
            },
            {
                "answer_argument": "m.0dv63j",
                "answer_type": "Entity",
                "entity_name": "1908 Democratic National Convention"
            },
            {
                "answer_argument": "m.0fr77c",
                "answer_type": "Entity",
                "entity_name": "1900 Democratic National Convention"
            }
        ],
        "s_expression": "(JOIN (R base.politicalconventions.presidential_nominee.nominated_at) m.0b3tf)",
        "s_expression_processed": "(JOIN (R base.politicalconventions.presidential_nominee.nominated_at) m.0b3tf)"
    },
    {
        "qid": "WebQTrn-55",
        "question": "who was queen victoria 's parents called",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.0cw10",
                    "class": "common.topic",
                    "friendly_name": "queen victoria",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.parents"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cw10)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cw10 ns:people.person.parents ?x .\n}\n",
        "topic_entity": "m.0cw10",
        "answer": [
            {
                "answer_argument": "m.01c50q",
                "answer_type": "Entity",
                "entity_name": "Prince Edward, Duke of Kent and Strathearn"
            },
            {
                "answer_argument": "m.024hvp",
                "answer_type": "Entity",
                "entity_name": "Princess Victoria of Saxe-Coburg-Saalfeld"
            }
        ],
        "s_expression": "(JOIN (R people.person.parents) m.0cw10)",
        "s_expression_processed": "(JOIN (R people.person.parents) m.0cw10)"
    },
    {
        "qid": "WebQTrn-56",
        "question": "what movies did sally field win an oscar for",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.01jw4r",
                    "class": "common.topic",
                    "friendly_name": "sally field",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 2,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 4,
                    "node_type": "entity",
                    "id": "m.0g_w",
                    "class": "common.topic",
                    "friendly_name": "Oscar",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 2,
                    "relation": "award.award_winner.awards_won"
                },
                {
                    "start": 2,
                    "end": 0,
                    "relation": "award.award_honor.honored_for"
                },
                {
                    "start": 2,
                    "end": 3,
                    "relation": "award.award_honor.award"
                },
                {
                    "start": 3,
                    "end": 4,
                    "relation": "award.award_category.category_of"
                }
            ]
        },
        "function": "none",
        "num_node": 5,
        "num_edge": 4,
        "sparql_query": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.01jw4r ns:award.award_winner.awards_won ?y .\t# Sally Field\n  ?y ns:award.award_honor.honored_for ?x .\n  ?y ns:award.award_honor.award ?awd .\n  ?awd ns:award.award_category.category_of ns:m.0g_w .  # Academy Awards\n}",
        "topic_entity": "m.01jw4r",
        "answer": [
            {
                "answer_argument": "m.0p_vt",
                "answer_type": "Entity",
                "entity_name": "Norma Rae"
            },
            {
                "answer_argument": "m.0sxjs",
                "answer_type": "Entity",
                "entity_name": "Places in the Heart"
            }
        ],
        "s_expression": "(JOIN (R award.award_honor.honored_for) (AND (JOIN (R award.award_winner.awards_won) m.01jw4r) (JOIN award.award_honor.award (JOIN award.award_category.category_of m.0g_w))))",
        "s_expression_processed": "(JOIN (R award.award_honor.honored_for) (AND (JOIN (R award.award_winner.awards_won) m.01jw4r) (JOIN award.award_honor.award (JOIN award.award_category.category_of m.0g_w))))"
    },
    {
        "qid": "WebQTrn-57",
        "question": "what is the first book sherlock holmes appeared in",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.06rkl",
                    "class": "common.topic",
                    "friendly_name": "sherlock holmes",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 2,
                    "node_type": "literal",
                    "id": "0^^http://www.w3.org/2001/XMLSchema#int",
                    "class": "common.topic",
                    "friendly_name": "0",
                    "question_node": 0,
                    "function": "argmin",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "book.book_character.appears_in_book"
                },
                {
                    "start": 0,
                    "end": 2,
                    "relation": "book.written_work.date_of_first_publication"
                }
            ]
        },
        "function": "argmin",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06rkl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06rkl ns:book.book_character.appears_in_book ?x .\n?x ns:book.written_work.date_of_first_publication ?sk0 .\n}\nORDER BY xsd:datetime(?sk0)\nLIMIT 1\n",
        "topic_entity": "m.06rkl",
        "answer": [
            {
                "answer_argument": "m.01gq2s",
                "answer_type": "Entity",
                "entity_name": "A Study in Scarlet"
            }
        ],
        "s_expression": "(ARGMIN (JOIN (R book.book_character.appears_in_book) m.06rkl) book.written_work.date_of_first_publication)",
        "s_expression_processed": "(ARGMIN (JOIN (R book.book_character.appears_in_book) m.06rkl) book.written_work.date_of_first_publication)"
    },
    {
        "qid": "WebQTrn-60",
        "question": "what countries do people speak portuguese",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.05zjd",
                    "class": "common.topic",
                    "friendly_name": "portuguese",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "language.human_language.countries_spoken_in"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05zjd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05zjd ns:language.human_language.countries_spoken_in ?x .\n}\n",
        "topic_entity": "m.05zjd",
        "answer": [
            {
                "answer_argument": "m.015fr",
                "answer_type": "Entity",
                "entity_name": "Brazil"
            },
            {
                "answer_argument": "m.01nqj",
                "answer_type": "Entity",
                "entity_name": "Cape Verde"
            },
            {
                "answer_argument": "m.02kcz",
                "answer_type": "Entity",
                "entity_name": "Equatorial Guinea"
            },
            {
                "answer_argument": "m.02lx0",
                "answer_type": "Entity",
                "entity_name": "Timor-Leste"
            },
            {
                "answer_argument": "m.034m8",
                "answer_type": "Entity",
                "entity_name": "Guyana"
            },
            {
                "answer_argument": "m.036b_",
                "answer_type": "Entity",
                "entity_name": "Guinea-Bissau"
            },
            {
                "answer_argument": "m.04thp",
                "answer_type": "Entity",
                "entity_name": "Macau"
            },
            {
                "answer_argument": "m.04wlh",
                "answer_type": "Entity",
                "entity_name": "Mozambique"
            },
            {
                "answer_argument": "m.05r4w",
                "answer_type": "Entity",
                "entity_name": "Portugal"
            },
            {
                "answer_argument": "m.0d05w3",
                "answer_type": "Entity",
                "entity_name": "China"
            },
            {
                "answer_argument": "m.0d060g",
                "answer_type": "Entity",
                "entity_name": "Canada"
            },
            {
                "answer_argument": "m.0hg5",
                "answer_type": "Entity",
                "entity_name": "Andorra"
            },
            {
                "answer_argument": "m.0hzlz",
                "answer_type": "Entity",
                "entity_name": "South Africa"
            },
            {
                "answer_argument": "m.0j4b",
                "answer_type": "Entity",
                "entity_name": "Angola"
            }
        ],
        "s_expression": "(JOIN (R language.human_language.countries_spoken_in) m.05zjd)",
        "s_expression_processed": "(JOIN (R language.human_language.countries_spoken_in) m.05zjd)"
    },
    {
        "qid": "WebQTrn-62",
        "question": "what are the names of walt disney kids",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.081nh",
                    "class": "common.topic",
                    "friendly_name": "walt disney",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.children"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081nh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081nh ns:people.person.children ?x .\n}\n",
        "topic_entity": "m.081nh",
        "answer": [
            {
                "answer_argument": "m.064ndq",
                "answer_type": "Entity",
                "entity_name": "Diane Disney Miller"
            },
            {
                "answer_argument": "m.07kyh5",
                "answer_type": "Entity",
                "entity_name": "Sharon Mae Disney"
            }
        ],
        "s_expression": "(JOIN (R people.person.children) m.081nh)",
        "s_expression_processed": "(JOIN (R people.person.children) m.081nh)"
    }
]