[
    {
        "qid": "WebQTrn-0",
        "question": "what is the name of justin bieber brother",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.06w2sn5",
                    "class": "common.topic",
                    "friendly_name": "justin bieber",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "entity",
                    "id": "m.05zppz",
                    "class": "common.topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 1,
                    "friendly_name": "male"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "people.person.sibling_s"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.sibling_relationship.sibling"
                },
                {
                    "start": 0,
                    "end": 3,
                    "relation": "people.person.gender"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06w2sn5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06w2sn5 ns:people.person.sibling_s ?y .\n?y ns:people.sibling_relationship.sibling ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "topic_entity": "m.06w2sn5",
        "answer": [
            {
                "answer_argument": "m.0gxnnwq",
                "answer_type": "Entity",
                "entity_name": "Jaxon Bieber"
            }
        ],
        "s_expression": "(AND (JOIN (R people.sibling_relationship.sibling) (JOIN (R people.person.sibling_s) m.06w2sn5)) (JOIN people.person.gender m.05zppz))",
        "s_expression_processed": "(CONS (JOIN (R people.sibling_relationship.sibling) (JOIN (R people.person.sibling_s) m.06w2sn5)) people.person.gender m.05zppz)"
    },
    {
        "qid": "WebQTrn-3",
        "question": "what country is the grand bahama island in",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.03st9j",
                    "class": "common.topic",
                    "friendly_name": "grand bahama island",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 2,
                    "node_type": "literal",
                    "id": "Country",
                    "class": "common.topic",
                    "friendly_name": "Country",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 1
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.location.containedby"
                },
                {
                    "start": 0,
                    "end": 2,
                    "relation": "base.biblioness.bibs_location.loc_type"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03st9j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03st9j ns:location.location.containedby ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\nFILTER (str(?sk0) = \"Country\")\n}\n",
        "topic_entity": "m.03st9j",
        "answer": [
            {
                "answer_argument": "m.0160w",
                "answer_type": "Entity",
                "entity_name": "Bahamas"
            }
        ],
        "s_expression": "(AND (JOIN (R location.location.containedby) m.03st9j) (JOIN base.biblioness.bibs_location.loc_type Country))",
        "s_expression_processed": "(CONS (JOIN (R location.location.containedby) m.03st9j) base.biblioness.bibs_location.loc_type Country)"
    },
    {
        "qid": "WebQTrn-4",
        "question": "what kind of money to take to bahamas",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.0160w",
                    "class": "common.topic",
                    "friendly_name": "bahamas",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.country.currency_used"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160w ns:location.country.currency_used ?x .\n}\n",
        "topic_entity": "m.0160w",
        "answer": [
            {
                "answer_argument": "m.01l6dm",
                "answer_type": "Entity",
                "entity_name": "Bahamian dollar"
            }
        ],
        "s_expression": "(JOIN (R location.country.currency_used) m.0160w)",
        "s_expression_processed": "(JOIN (R location.country.currency_used) m.0160w)"
    },
    {
        "qid": "WebQTrn-5",
        "question": "what character did john noble play in lord of the rings",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.02fgm7",
                    "class": "common.topic",
                    "friendly_name": "john noble",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 3,
                    "node_type": "entity",
                    "id": "m.017gm7",
                    "class": "common.topic",
                    "friendly_name": "lord of the rings",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "film.actor.film"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "film.performance.character"
                },
                {
                    "start": 1,
                    "end": 3,
                    "relation": "film.performance.film"
                }
            ]
        },
        "function": "none",
        "num_node": 4,
        "num_edge": 3,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02fgm7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02fgm7 ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n?y ns:film.performance.film ns:m.017gm7 .\n}\n",
        "topic_entity": "m.02fgm7",
        "answer": [
            {
                "answer_argument": "m.0gp7f",
                "answer_type": "Entity",
                "entity_name": "Denethor II"
            }
        ],
        "s_expression": "(JOIN (R film.performance.character) (AND (JOIN (R film.actor.film) m.02fgm7) (JOIN film.performance.film m.017gm7)))",
        "s_expression_processed": "(JOIN (R film.performance.character) (AND (JOIN (R film.actor.film) m.02fgm7) (JOIN film.performance.film m.017gm7)))"
    },
    {
        "qid": "WebQTrn-6",
        "question": "who does joakim noah play for",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.0c2yrf",
                    "class": "common.topic",
                    "friendly_name": "joakim noah",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": [
                        "NOW",
                        "sports.sports_team_roster.from"
                    ]
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "sports.pro_athlete.teams"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "sports.sports_team_roster.team"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c2yrf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c2yrf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nFILTER(NOT EXISTS {?y ns:sports.sports_team_roster.from ?sk0} || \nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 . \nFILTER(xsd:datetime(?sk1) <= \"2015-08-10\"^^xsd:dateTime) })\nFILTER(NOT EXISTS {?y ns:sports.sports_team_roster.to ?sk2} || \nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 . \nFILTER(xsd:datetime(?sk3) >= \"2015-08-10\"^^xsd:dateTime) })\n}\n",
        "topic_entity": "m.0c2yrf",
        "answer": [
            {
                "answer_argument": "m.0jm74",
                "answer_type": "Entity",
                "entity_name": "Chicago Bulls"
            }
        ],
        "s_expression": "(JOIN (R sports.sports_team_roster.team) (TC (JOIN (R sports.pro_athlete.teams) m.0c2yrf) sports.sports_team_roster.from NOW))",
        "s_expression_processed": "(JOIN (R sports.sports_team_roster.team) (TC (JOIN (R sports.pro_athlete.teams) m.0c2yrf) sports.sports_team_roster.from NOW))"
    },
    {
        "qid": "WebQTrn-7",
        "question": "where are the nfl redskins from",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.084l5",
                    "class": "common.topic",
                    "friendly_name": "redskins",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "sports.sports_team.location"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.084l5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.084l5 ns:sports.sports_team.location ?x .\n}\n",
        "topic_entity": "m.084l5",
        "answer": [
            {
                "answer_argument": "m.0rh6k",
                "answer_type": "Entity",
                "entity_name": "Washington, D.C."
            }
        ],
        "s_expression": "(JOIN (R sports.sports_team.location) m.084l5)",
        "s_expression_processed": "(JOIN (R sports.sports_team.location) m.084l5)"
    },
    {
        "qid": "WebQTrn-8",
        "question": "where did saki live",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.07484",
                    "class": "common.topic",
                    "friendly_name": "saki",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.place_of_birth"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07484)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07484 ns:people.person.place_of_birth ?x .\n}\n",
        "topic_entity": "m.07484",
        "answer": [
            {
                "answer_argument": "m.05ql8_",
                "answer_type": "Entity",
                "entity_name": "Sittwe"
            }
        ],
        "s_expression": "(JOIN (R people.person.place_of_birth) m.07484)",
        "s_expression_processed": "(JOIN (R people.person.place_of_birth) m.07484)"
    },
    {
        "qid": "WebQTrn-9",
        "question": "how old is sacha baron cohen",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.0c9c0",
                    "class": "common.topic",
                    "friendly_name": "sacha baron cohen",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.date_of_birth"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c9c0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c9c0 ns:people.person.date_of_birth ?x .\n}\n",
        "topic_entity": "m.0c9c0",
        "answer": [
            {
                "answer_argument": "1971-10-13",
                "answer_type": "Value",
                "entity_name": null
            }
        ],
        "s_expression": "(JOIN (R people.person.date_of_birth) m.0c9c0)",
        "s_expression_processed": "(JOIN (R people.person.date_of_birth) m.0c9c0)"
    },
    {
        "qid": "WebQTrn-11",
        "question": "what time zone am i in cleveland ohio",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.01sn3",
                    "class": "common.topic",
                    "friendly_name": "cleveland ohio",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.location.time_zones"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01sn3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01sn3 ns:location.location.time_zones ?x .\n}\n",
        "topic_entity": "m.01sn3",
        "answer": [
            {
                "answer_argument": "m.02hcv8",
                "answer_type": "Entity",
                "entity_name": "Eastern Time Zone"
            }
        ],
        "s_expression": "(JOIN (R location.location.time_zones) m.01sn3)",
        "s_expression_processed": "(JOIN (R location.location.time_zones) m.01sn3)"
    },
    {
        "qid": "WebQTrn-12",
        "question": "who did draco malloy end up marrying",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.0c2m4",
                    "class": "common.topic",
                    "friendly_name": "draco malloy",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "fictional_universe.fictional_character.married_to"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "fictional_universe.marriage_of_fictional_characters.spouses"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c2m4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c2m4 ns:fictional_universe.fictional_character.married_to ?y .\n?y ns:fictional_universe.marriage_of_fictional_characters.spouses ?x .\n}\n",
        "topic_entity": "m.0c2m4",
        "answer": [
            {
                "answer_argument": "m.09k254x",
                "answer_type": "Entity",
                "entity_name": "Astoria Greengrass"
            }
        ],
        "s_expression": "(JOIN (R fictional_universe.marriage_of_fictional_characters.spouses) (JOIN (R fictional_universe.fictional_character.married_to) m.0c2m4))",
        "s_expression_processed": "(JOIN (R fictional_universe.marriage_of_fictional_characters.spouses) (JOIN (R fictional_universe.fictional_character.married_to) m.0c2m4))"
    },
    {
        "qid": "WebQTrn-13",
        "question": "which countries border the us",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "location.country",
                    "class": "location.country",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 2,
                    "node_type": "entity",
                    "id": "m.09c7w0",
                    "class": "common.topic",
                    "friendly_name": "us",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                },
                {
                    "nid": 1,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "Common topic",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none"
                }
            ],
            "edges": [
                {
                    "start": 2,
                    "end": 1,
                    "relation": "location.location.adjoin_s"
                },
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.adjoining_relationship.adjoins"
                }
            ]
        },
        "function": "none",
        "num_node": 3,
        "num_edge": 2,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09c7w0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09c7w0 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "topic_entity": "m.09c7w0",
        "answer": [
            {
                "answer_argument": "m.0b90_r",
                "answer_type": "Entity",
                "entity_name": "Mexico"
            },
            {
                "answer_argument": "m.0d060g",
                "answer_type": "Entity",
                "entity_name": "Canada"
            }
        ],
        "s_expression": "(AND location.country (JOIN (R location.adjoining_relationship.adjoins) (JOIN (R location.location.adjoin_s) m.09c7w0)))",
        "s_expression_processed": "(AND location.country (JOIN (R location.adjoining_relationship.adjoins) (JOIN (R location.location.adjoin_s) m.09c7w0)))"
    },
    {
        "qid": "WebQTrn-14",
        "question": "where is rome italy located on a map",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.06c62",
                    "class": "common.topic",
                    "friendly_name": "rome italy",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "location.location.containedby"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c62 ns:location.location.containedby ?x .\n}\n",
        "topic_entity": "m.06c62",
        "answer": [
            {
                "answer_argument": "m.03rjj",
                "answer_type": "Entity",
                "entity_name": "Italy"
            },
            {
                "answer_argument": "m.04q_g",
                "answer_type": "Entity",
                "entity_name": "Lazio"
            },
            {
                "answer_argument": "m.098phg",
                "answer_type": "Entity",
                "entity_name": "Province of Rome"
            }
        ],
        "s_expression": "(JOIN (R location.location.containedby) m.06c62)",
        "s_expression_processed": "(JOIN (R location.location.containedby) m.06c62)"
    },
    {
        "qid": "WebQTrn-15",
        "question": "what is nina dobrev nationality",
        "graph_query": {
            "nodes": [
                {
                    "nid": 0,
                    "node_type": "class",
                    "id": "common.topic",
                    "class": "common.topic",
                    "friendly_name": "common.topic",
                    "question_node": 1,
                    "function": "none",
                    "time_constraint": "none"
                },
                {
                    "nid": 1,
                    "node_type": "entity",
                    "id": "m.027nwk2",
                    "class": "common.topic",
                    "friendly_name": "nina dobrev",
                    "question_node": 0,
                    "function": "none",
                    "time_constraint": "none",
                    "implicit": 0
                }
            ],
            "edges": [
                {
                    "start": 1,
                    "end": 0,
                    "relation": "people.person.nationality"
                }
            ]
        },
        "function": "none",
        "num_node": 2,
        "num_edge": 1,
        "sparql_query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027nwk2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027nwk2 ns:people.person.nationality ?x .\n}\n",
        "topic_entity": "m.027nwk2",
        "answer": [
            {
                "answer_argument": "m.015qh",
                "answer_type": "Entity",
                "entity_name": "Bulgaria"
            },
            {
                "answer_argument": "m.0d060g",
                "answer_type": "Entity",
                "entity_name": "Canada"
            }
        ],
        "s_expression": "(JOIN (R people.person.nationality) m.027nwk2)",
        "s_expression_processed": "(JOIN (R people.person.nationality) m.027nwk2)"
    }
]